---
kind: type
id: T:Autodesk.Revit.DB.HostObject
source: html/56a32e0b-df65-a6ba-40bd-8f50a1f31dcd.htm
---
# Autodesk.Revit.DB.HostObject

A base class that provides support for all objects that can host other objects, such as walls roofs, and floors.

## Syntax (C#)
```csharp
public class HostObject : Element
```